In [3]:
import datetime

In [15]:
format = "%Y-%m-%d %H:%M:%S"
datetime_str = "2018-05-13 12:34:56"
datetime_dt = datetime.datetime.strptime(datetime_str, format)
print(type(datetime_dt))
print(datetime_dt)

<class 'datetime.datetime'>
2018-05-13 12:34:56

In [16]:
datetime_str = datetime_dt.strftime("%Y-%m-%d %H:%M:%S")
print(type(datetime_str)) 
print(datetime_str)

<class 'str'>
2018-05-13 12:34:56

In [17]:
#str 타입은 ISO 8601 형식에 맞춰서 사용해야 한다.
import numpy as np
np.datetime64('2020-01-01')

numpy.datetime64('2020-01-01')

In [19]:
np.datetime64('1000', 'ns')

numpy.datetime64('2169-02-08T23:09:07.419103232')

In [20]:
np.datetime64('1000', 'D')

numpy.datetime64('1000-01-01')

In [21]:
np.datetime64('10000000000','s')

numpy.datetime64('10000000000-01-01T00:00:00')

In [27]:
np.array(['2007-07-13','2006-01-13','2010-08-13'],dtype='datetime64[D]')

array(['2007-07-13', '2006-01-13', '2010-08-13'], dtype='datetime64[D]')

In [31]:
np.arange('2005-02','2005-03',dtype='datetime64[D]')

array(['2005-02-01', '2005-02-02', '2005-02-03', '2005-02-04',
       '2005-02-05', '2005-02-06', '2005-02-07', '2005-02-08',
       '2005-02-09', '2005-02-10', '2005-02-11', '2005-02-12',
       '2005-02-13', '2005-02-14', '2005-02-15', '2005-02-16',
       '2005-02-17', '2005-02-18', '2005-02-19', '2005-02-20',
       '2005-02-21', '2005-02-22', '2005-02-23', '2005-02-24',
       '2005-02-25', '2005-02-26', '2005-02-27', '2005-02-28'],
      dtype='datetime64[D]')

In [33]:
np.arange('2005-02', '2006-03', dtype='datetime64[M]')

array(['2005-02', '2005-03', '2005-04', '2005-05', '2005-06', '2005-07',
       '2005-08', '2005-09', '2005-10', '2005-11', '2005-12', '2006-01',
       '2006-02'], dtype='datetime64[M]')

In [34]:
np.datetime64('1986-07-28')-np.datetime64('2023-03-20')

numpy.timedelta64(-13384,'D')

In [35]:
import pandas as pd

Timestamp('1973-05-24 02:58:24.389760')

In [36]:
pd.Timestamp(1239.1238934, unit='D')

Timestamp('1973-05-24 02:58:24.389760')

In [37]:
pd.Timestamp('2019-1-1')

Timestamp('2019-01-01 00:00:00')

In [38]:
pd.to_datetime('2019-01-01 12')

Timestamp('2019-01-01 12:00:00')

In [40]:
pd.to_datetime(['2018-1-1', '2019-1-2'])

DatetimeIndex(['2018-01-01', '2019-01-02'], dtype='datetime64[ns]', freq=None)

In [41]:
pd.date_range('2019-01','2019-02')

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10', '2019-01-11', '2019-01-12',
               '2019-01-13', '2019-01-14', '2019-01-15', '2019-01-16',
               '2019-01-17', '2019-01-18', '2019-01-19', '2019-01-20',
               '2019-01-21', '2019-01-22', '2019-01-23', '2019-01-24',
               '2019-01-25', '2019-01-26', '2019-01-27', '2019-01-28',
               '2019-01-29', '2019-01-30', '2019-01-31', '2019-02-01'],
              dtype='datetime64[ns]', freq='D')

In [71]:
sam_df = pd.read_csv('../data/005930.KS.csv')

In [43]:
df.head()

         Date     Open     High      Low    Close     Adj Close    Volume
0  2022-03-21  70900.0  71000.0  69900.0  69900.0  68219.710938  11169002
1  2022-03-22  69900.0  70500.0  69900.0  70300.0  68610.093750   9402666
2  2022-03-23  70600.0  71200.0  70300.0  70500.0  68805.289063  12398025
3  2022-03-24  69600.0  70300.0  69600.0  69800.0  68122.109375  37943357
4  2022-03-25  70100.0  70200.0  69600.0  69800.0  68122.109375  12986010

In [66]:
sam_df = pd.read_csv('../data/005930.KS.csv', index_col='Date', parse_dates=['Date'])

In [67]:
sam_df.head()

               Open     High      Low    Close     Adj Close    Volume
Date
2022-03-21  70900.0  71000.0  69900.0  69900.0  68219.710938  11169002
2022-03-22  69900.0  70500.0  69900.0  70300.0  68610.093750   9402666
2022-03-23  70600.0  71200.0  70300.0  70500.0  68805.289063  12398025
2022-03-24  69600.0  70300.0  69600.0  69800.0  68122.109375  37943357
2022-03-25  70100.0  70200.0  69600.0  69800.0  68122.109375  12986010

In [47]:
type(df.index)

pandas.core.indexes.datetimes.DatetimeIndex

In [50]:
type(df.index[0])

pandas._libs.tslibs.timestamps.Timestamp

In [51]:
s1 = pd.Series([1, np.nan, 3, 4, 5])
s2 = pd.Series([1, 2, np.nan, 4, 5])
s3 = pd.Series([1, 2, 3, np.nan, 5])

df = pd.DataFrame({'s1': s1, 's2': s2, 's3': s3})

df.head()

    s1   s2   s3
0  1.0  1.0  1.0
1  NaN  2.0  2.0
2  3.0  NaN  3.0
3  4.0  4.0  NaN
4  5.0  5.0  5.0

In [52]:
df['s1'].isna()

0    False
1     True
2    False
3    False
4    False
Name: s1, dtype: bool

In [53]:
df.isna()

      s1     s2     s3
0  False  False  False
1   True  False  False
2  False   True  False
3  False  False   True
4  False  False  False

In [54]:
df.isna().sum()

s1    1
s2    1
s3    1
dtype: int64

In [55]:
df.isin([np.nan])

      s1     s2     s3
0  False  False  False
1   True  False  False
2  False   True  False
3  False  False   True
4  False  False  False

In [56]:
df.isin([np.nan]).sum()

s1    1
s2    1
s3    1
dtype: int64

In [57]:
df.fillna(0)

    s1   s2   s3
0  1.0  1.0  1.0
1  0.0  2.0  2.0
2  3.0  0.0  3.0
3  4.0  4.0  0.0
4  5.0  5.0  5.0

In [58]:
df.fillna(method='pad')

    s1   s2   s3
0  1.0  1.0  1.0
1  1.0  2.0  2.0
2  3.0  2.0  3.0
3  4.0  4.0  3.0
4  5.0  5.0  5.0

In [59]:
df.fillna(method='bfill')

    s1   s2   s3
0  1.0  1.0  1.0
1  3.0  2.0  2.0
2  3.0  4.0  3.0
3  4.0  4.0  5.0
4  5.0  5.0  5.0

In [60]:
#결측치를 전부 제거 한다.
df.dropna()

    s1   s2   s3
0  1.0  1.0  1.0
4  5.0  5.0  5.0

In [61]:
df.dropna(axis='rows')

    s1   s2   s3
0  1.0  1.0  1.0
4  5.0  5.0  5.0

In [62]:
df.dropna(axis=0)

    s1   s2   s3
0  1.0  1.0  1.0
4  5.0  5.0  5.0

In [63]:
#dropna() 함수를 사용해 결측치가 발생한 행이나 열을 완전히 제거하는 방법도 사용한다. 행을 제거할지, 열을 제거할지 여부는 axis 값을 설정해 변경할 수 있다. axis=0은 아래로 향하는 행 방향이다. 열 방향으로 계산하려면 axis=1
#을 전달하면 된다. 많이 헷갈리는 부분이나 반드시 기억하기 바란다. 디폴트 값은 0 이다. 따라서 열을 제거하고자 할 때 axis=1값을 지정하는 것만 기억하면 된다. 아니면 rows나 columns를 사용해도 헷갈림을 방지할 수 있다.

In [64]:
df.dropna(axis='columns')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [65]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

인덱스를 제외하고 모든 열에 결측치가 존재하기 때문에 모든 열이 삭제된다. 우리가 불러온 애플 주가 데이터에 결측치가 있는지 한번 살펴보자.

In [72]:
sam_df[sam_df.isin([np.nan, np.inf, -np.inf]).any(1)]

Empty DataFrame
Columns: [Date, Open, High, Low, Close, Adj Close, Volume]
Index: []

In [73]:
sam_df.head()

         Date     Open     High      Low    Close     Adj Close    Volume
0  2022-03-21  70900.0  71000.0  69900.0  69900.0  68219.710938  11169002
1  2022-03-22  69900.0  70500.0  69900.0  70300.0  68610.093750   9402666
2  2022-03-23  70600.0  71200.0  70300.0  70500.0  68805.289063  12398025
3  2022-03-24  69600.0  70300.0  69600.0  69800.0  68122.109375  37943357
4  2022-03-25  70100.0  70200.0  69600.0  69800.0  68122.109375  12986010

야후 파이낸스에서 받은 데이터지만 결측치가 있다는 것을 확인할 수 있다. 결측치 외에도 데이터의 계산 결과 무한값이 생성되어 이후 연산등이 어려워질 수 있으니 이들을 조정해야 한다. 위 코드는 결측치와 무한값을 동시에 찾아낼 수 있다.

In [74]:
df[df.isin([np.nan, np.inf, -np.inf]).any(axis=1)]

    s1   s2   s3
1  NaN  2.0  2.0
2  3.0  NaN  3.0
3  4.0  4.0  NaN

In [75]:
df

    s1   s2   s3
0  1.0  1.0  1.0
1  NaN  2.0  2.0
2  3.0  NaN  3.0
3  4.0  4.0  NaN
4  5.0  5.0  5.0

In [76]:
df[df.isin([1]).any(axis=1)]

    s1   s2   s3
0  1.0  1.0  1.0